let DEVEL_QUESTION_SHOW = true // automaticly sets to false at deploy
let DEVEL_MINUTES_BEFORE_RELOAD = 1
let DEVEL_QUESTION_CONTENT_STRINGIFYABLE =
`Привет! Это скелет программы, то, как оно будет выглядеть.
Во первых, как ты видишь, спрайты неочень.
У них неунифицированные размеры, где ты их вообще
отыскал? Кароче, через ${DEVEL_MINUTES_BEFORE_RELOAD} минуты игра перезагрузится
с другими спрайтами, более естетичными
на мой взгляд. Это рандомный пак из интернета.
(надо подождать, надеюсь ты успеешь дочитать этот текст)
Я предлагаю тебе поискать бесплатные тайлсеты
с возможностью коммерческого использования.
Пришли мне ссылки где их можно скачать. Все ресурсы
присылай ввиде ссылок на сами ресурсы, чтобы я
мог регистрировать источники (у мня обсессия на этом).
Также ты должен описать логику игры. По порядку,
как будто ты программу пишешь, но при этом на русском
языке, я имею ввиду синтетическом. А то то что ты
мне присылал -- если я сходу не понимаю что написано,
я не буду разбираться, мне лень и я не понимаю просто.
Надеюсь ты понял что я хотел сказать, опиши очень подробно,
минимум слов, максимум смысла, как у витгенштейна, целую,
обнимаю, жду листинг логики`
let DEVEL_QUESTION_DELAY_BEFORE_SHOW = 5000
let DEVEL_QUESTION_DELAY_BEFORE_RELOAD = DEVEL_MINUTES_BEFORE_RELOAD * 60 * 1000
// DEVEL_QUESTION_DELAY_BEFORE_RELOAD = 0
DEVEL_QUESTION_CONTENT_STRINGIFYABLE =
`привет! надеюсь этот текст читабельный. кароче.
я написал основу. логики пока нету. ты напиши
мне что должно происходить в игре. чтобы я понял,
подробно, четко, без напускного. ТЗ называется.
скоро игра перезагрузится с новыми спрайтами,
через 10 скунд после того как это сообщение
пропадет. мне кажется те спрайты более эстетичные.

не знаю, я вот со многими людьми общался в жизни,
и всего один раз встретил человека, у которого
было чувство эстетики такое же развитое как
у меня. чувствовать красоту мира, способность
повторить натуральное слияние порядка форм,
гармонизация пространства -- это умение которое
в себе нужно воспитывать, но мне оно досталось
от рождения.

лучше всего -- это скорпировать то что уже
существует. это было доказано комбинаторно,
фактом пристуствия машин, способных воспроизводить
человеческую форму предстваления об эстетике.

жду ТЗ целую обнимаю
`